Revit 2027 API
BuiltInFailures.RoofFailures.HadToAlignEaves Property
 Adjacent slope-defining lines must have identical eave heights. Eaves were aligned to higher location automatically to avoid failure. Use the Align Eaves tool to specify desired location.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HadToAlignEaves { get; }
Public Shared ReadOnly Property HadToAlignEaves As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HadToAlignEaves {
	FailureDefinitionId^ get ();
}
static member HadToAlignEaves : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace